{
  "layout.header.logo_alt": "Malaury Keslick stilisiertes Logo",
  "layout.header.home": "Startseite",
  "layout.header.about": "Über mich",
  "layout.header.projects": "Meine Projekte",
  "layout.header.contact": "Kontakt",
  "layout.header.darkMode_alt": "Umschalten des Dunkelmodus",

  "layout.footer.madeBy": "Von Maulray",
  "layout.footer.github_alt": "GitHub-Logo",
  "layout.footer.linkedin_alt": "LinkedIn-Logo",
  "layout.footer.phone_alt": "Telefonlogo",
  "layout.footer.learnMore": "Möchten Sie mehr über mich erfahren?",
  "layout.footer.contact": "Lassen Sie uns einen Termin vereinbaren!",

  "homepage.hi": "Hallo!",
  "homepage.iAm": "Ich bin Malaury Keslick",
  "homepage.jobTitle": "Node.js Web- und Softwareentwickler",
  "homepage.learnMore": "Möchten Sie mehr erfahren?",
  "homepage.contact": "Kontaktieren Sie mich!",
  "homepage.picture": "Hauptporträt",

  "about.title": "Ein bisschen mehr über mich",
  "about.personalPresentation_1": "Hey! Ich bin Malaury, eine 26-jährige Softwareingenieurin. Nach zwei schönen Jahren in der Schweiz, im Kanton St. Gallen, kehre ich nun nach Straßburg zurück. Diese Zeit hat mir ermöglicht, meine Kreativität zu entfalten und meine technischen Fähigkeiten zu vertiefen, indem ich komplette Webseiten wie diese entworfen und entwickelt habe, umgeben von einer inspirierenden und beruhigenden Landschaft zwischen Bergen und großen Seen.",
  "about.personalPresentation_2": "Wenn ich nicht gerade programmiere, koche ich gerne, zeichne, singe oder spiele Videospiele mit Freunden. Ich bin von Natur aus neugierig und habe den Wunsch, zu verstehen, wie Dinge funktionieren, und sie für alle zugänglich zu machen. Ich liebe es, einfache, nützliche und intuitive Lösungen zu schaffen, die das Leben erleichtern statt zu verkomplizieren.",
  "about.personalPresentation_portrait_alt": "Ich selbst vor dem Werdenbergsee und dem Schloss, gelegen in Buchs SG, Schweiz",
  "about.backgroundPresentation_portrait_alt": "Ich selbst mit meiner Abschlussrobe und meinem Diplom bei meiner Abschlussfeier",
  "about.backgroundPresentation_1": "Ich habe es schon immer gemocht, Dinge zu verstehen – sei es Rätsel, Matheprobleme oder knifflige Bugs im Code. Diese Neugier führte mich dazu, Softwaretechnik an der Telecom Nancy zu studieren – einer französischen Ingenieurschule des Mines-Telecom-Instituts. Das generalistische Programm vermittelte mir ein starkes Fundament in allem von Algorithmen über Systemarchitektur bis hin zu künstlicher Intelligenz und Datenbanken, und erlaubte mir, flexibel in allen Bereichen der Entwicklung zu arbeiten und zwischen Programmiersprachen zu wechseln.",
  "about.backgroundPresentation_2": "Danach begann ich meine Karriere als Full-Stack-Webingenieurin bei Sopra Steria im KI-Team in Straßburg, wo ich drei Jahre lang tätig war. Ich arbeitete an der Entwicklung und Wartung groß angelegter Chatbot-Lösungen, hauptsächlich mit dem MERN-Stack (MongoDB, Express, React & Node.js).",
  "about.backgroundPresentation_3": "In den letzten zwei Jahren habe ich meine Kenntnisse weiter vertieft, indem ich diese persönliche Website und eine Website für eine Hochschulforscherin entwickelt habe, um ihre wissenschaftlichen Inhalte zugänglicher zu machen und Lehrmaterialien für Studierende zu zentralisieren.",
  "about.backgroundPresentation_4": "Heute suche ich eine Stelle als Webentwicklerin in Straßburg oder Umgebung, gerne auch mit der Möglichkeit, überwiegend remote zu arbeiten. Ich möchte Teil eines interdisziplinären Teams werden, in dem ich meine Fähigkeiten in sinnvolle, zugängliche und wertorientierte Projekte einbringen kann.",
  "about.resumeIntroduction_1": "Wenn Sie mehr über meinen Hintergrund oder meine Fähigkeiten erfahren möchten, werfen Sie gerne einen Blick auf meinen Lebenslauf unten. Und wenn Sie Fragen haben oder einfach plaudern möchten, zögern Sie nicht, ",
  "about.resumeIntroduction_link": "mich zu kontaktieren",
  "about.resumeIntroduction_2": " – ich freue mich immer auf einen Austausch!",
  "about.openResume": "Im PDF-Viewer öffnen",
  "about.downloadResume": "Herunterladen",
  "about.resume_alt": "Lebenslauf",

  "projects.title": "Meine Projekte",
  "projects.1.title": "Entwicklung der Website einer Lehrenden und Forscherin",
  "projects.1.img_alt": "Illustration Lehrende/Forscherin",
  "projects.1.date": "2025 - Momentan in der Entwurfsphase",
  "projects.1.descr": "Konzeption und Entwicklung einer Website für eine Lehrende und Forscherin, die einen zentralen Bereich bietet, um ihre wissenschaftlichen Publikationen und Lehrmaterialien für Studierende bereitzustellen. Ziel des Projekts ist es, den Zugang zu Bildungsressourcen zu erleichtern und die Darstellung ihrer akademischen Arbeit zu modernisieren.",
  "projects.2.title": "Entwicklung meines persönlichen Portfolios (d.h. dieser Website!)",
  "projects.2.img_alt": "Portfolio-Illustration",
  "projects.2.date": "2025",
  "projects.2.descr": "Konzeption und Entwicklung eines persönlichen Portfolios, um meine Fähigkeiten zu festigen und eine professionelle Präsentation zu schaffen, die im Rahmen meiner Jobsuche genutzt werden kann. Dieses Projekt ermöglichte es mir außerdem, ein Projekt erstmals vollständig eigenständig zu betreuen, von der Konzeption über die Entwicklung bis hin zur Bereitstellung.",
  "projects.3.title": "Junior Webentwicklerin bei Sopra Steria, Straßburg, Frankreich",
  "projects.3.img_alt": "Chatbot-Illustration",
  "projects.3.date": "Von 2021 bis 2024",
  "projects.3.descr": "Ich war Full-Stack-Entwicklerin im Team Sopra Steria Alive Intelligence und habe an der Konzeption, Entwicklung und Wartung einer groß angelegten SaaS-Chatbot-Lösung mitgewirkt. Täglich arbeitete ich mit Node.js, TypeScript/Javascript, React, IMB Cloud und MongoDB und entwickelte skalierbare Features über die gesamte Stack, während ich die Stabilität und Performance der Systeme sicherstellte. Außerdem habe ich an wichtigen Optimierungen mitgewirkt, damit die Datenverarbeitung schneller und die Systeme für unsere Kunden zuverlässig bleiben.\n\nNeben meiner Hauptrolle habe ich an einem Forschungs- und Entwicklungsprojekt gearbeitet, das die Analyse und Optimierung des Chatbot-Trainings verbessern sollte. Außerdem habe ich an der Frontend-Entwicklung eines Chatbot Proof of Concept für Airbus mitgewirkt und das BPM-Team gelegentlich bei Frontend-Projekten unterstützt, wodurch ich mit verschiedenen Teams zusammenarbeiten konnte.",
  "projects.gitHubRedirect": "Schau gerne auf meinem ",
  "projects.gitHubRedirect_2": " vorbei!",

  "contact.title": "Lassen Sie uns in Kontakt treten!",
  "contact.subTitle": "Schreiben Sie mir eine E-Mail!",
  "contact.nameField": "Name",
  "contact.nameField.error": "Bitte geben Sie Ihren Namen ein.",
  "contact.emailField": "E-Mail",
  "contact.emailField.error": "Bitte geben Sie eine gültige E-Mail-Adresse ein.",
  "contact.subjectField": "Betreff",
  "contact.subjectField.error": "Bitte geben Sie einen Betreff ein.",
  "contact.messageField": "Nachricht",
  "contact.messageField.error": "Bitte geben Sie Ihre Nachricht ein.",
  "contact.sendButton": "Senden",
  "contact.captchaRequired": "Bitte füllen Sie das Captcha aus, bevor Sie Ihre Nachricht senden.",
  "contact.alternativeContact_1": "Alternativ senden Sie Ihre E-Mail direkt an ",
  "contact.alternativeContact_2": " oder kontaktieren Sie mich auf ",
  "contact.thankYou": "Vielen Dank für Ihre Nachricht!",
  "contact.thankYou_2": "Ich melde mich in Kürze bei Ihnen.",
  "contact.back": "Zurück",
  "contact.error.title": "Ups! Etwas ist schiefgelaufen...",
  "contact.error.descr": "Beim Senden Ihrer Nachricht ist ein Fehler aufgetreten. Ich entschuldige mich für die Unannehmlichkeiten. Wenn das Problem weiterhin besteht, kontaktieren Sie mich bitte direkt unter ",

  "error.img_alt": "'OOPS'-Illustration",
  "error.title": "Etwas ist schiefgelaufen...",
  "error.content_1": "Es sieht so aus, als würde diese Seite momentan nicht reagieren. Das könnte an hohem Traffic oder einem vorübergehenden Problem auf meiner Seite liegen.",
  "error.content_2": "Hier sind ein paar Dinge, die du versuchen kannst:",
  "error.content_3": "• Lade die Seite nach ein paar Momenten neu.",
  "error.content_4": "• Überprüfe deine Internetverbindung.",
  "error.content_5_1": "• Wenn das Problem weiterhin besteht, bitte ",
  "error.content_5_2": "eröffne ein Issue",
  "error.content_5_3": " oder kontaktiere mich unter ",
  "error.content_6": "Ich entschuldige mich für die Unannehmlichkeiten und danke dir für deine Geduld!",

  "legal.title": "Impressum",
  "legal.preamble": "Diese Website ist ein persönliches Portfolio ohne kommerzielle Absicht.",
  "legal.editor.title": "Seitenbetreiber",
  "legal.editor.content.name": "Name",
  "legal.editor.content.status": "Status: Privatperson, keine geschäftliche Nutzung",
  "legal.host.title": "Hosting",
  "legal.host.content.intro": "Diese Website wird gehostet von:",
  "legal.host.content.address_1": "2325 3rd Street, Suite 296",
  "legal.host.content.address_2": "San Francisco, California 94107",
  "legal.property.title": "Urheberrecht",
  "legal.property.content": "Die auf dieser Website veröffentlichten Inhalte (Texte, Bilder, Projekte) sind, sofern nicht anders angegeben, Eigentum des Seitenbetreibers. Eine Vervielfältigung oder Verwendung ist ohne ausdrückliche Genehmigung nicht gestattet.",
  "legal.contact.title": "Kontakt",
  "legal.contact.content_1": "Bei allen Anfragen nutzen Sie bitte ",
  "legal.contact.content_2": "das Kontaktformular",
  "legal.contact.content_3": " oder schreiben Sie direkt an: ",

  "privacy.title": "Datenschutzerklärung",
  "privacy_1_1": "Diese Website enthält ein Kontaktformular, über das Besucher dem Betreiber der Website eine Nachricht senden können.",
  "privacy_1_2": "Folgende Daten werden erhoben:",
  "privacy_1_3": "Name",
  "privacy_1_4": "E-Mail-Adresse",
  "privacy_1_5": "Betreff",
  "privacy_1_6": "Nachricht",
  "privacy_2": "Diese Daten werden direkt per E-Mail an den Website-Betreiber gesendet und **nicht auf dem Server gespeichert** oder anderweitig verwendet.",
  "privacy_3_1": "Es erfolgt keine Weitergabe der Daten an Dritte.",
  "privacy_3_2": "Diese Website verwendet keine Tracking-Cookies oder Analyse-Tools.",
  "privacy_4": "Zweck der Datenerhebung",
  "privacy_4_1": "Die erhobenen Daten werden ausschließlich zur Beantwortung von Nachrichten verwendet, die über das Kontaktformular gesendet werden.",
  "privacy_5": "Aufbewahrungsdauer",
  "privacy_5_1": "Die empfangenen Nachrichten können bis zu 1 Jahr im E-Mail-Postfach des Website-Betreibers gespeichert werden.",
  "privacy_5_2": "Nachrichten, die Teil eines laufenden Projekts oder einer laufenden Korrespondenz sind, können bei Bedarf länger aufbewahrt werden.",
  "privacy_6": "Ihre Rechte",
  "privacy_6_1": "Gemäß der DSGVO haben Sie das Recht auf Auskunft, Berichtigung oder Löschung Ihrer personenbezogenen Daten.",
  "privacy_6_2": "Bitte wenden Sie sich hierzu an: ",
  "privacy_7": "Verantwortlicher",
  "privacy_7_1": "Name"
}
