{
  "layout.header.logo_alt": "Malaury Keslick stylized logo",
  "layout.header.home": "Home",
  "layout.header.about": "About me",
  "layout.header.projects": "My projects",
  "layout.header.contact": "Contact",
  "layout.header.darkMode_alt": "Dark Mode toggle",

  "layout.footer.madeBy": "By Maulray",
  "layout.footer.github_alt": "GitHub logo",
  "layout.footer.linkedin_alt": "LinkedIn logo",
  "layout.footer.phone_alt": "Phone logo",
  "layout.footer.learnMore": "Want to know more about me ?",
  "layout.footer.contact": "Let's plan a call!",

  "homepage.hi": "Hi!",
  "homepage.iAm": "I am Malaury Keslick",
  "homepage.jobTitle": "A Node.js Web and Software Engineer",
  "homepage.learnMore": "Want to learn more ?",
  "homepage.contact": "Contact me!",
  "homepage.picture": "Main portrait",

  "about.title": "A little bit more about me",
  "about.personalPresentation_1": "Hey there! I'm Malaury, a 26-year-old software engineer. I'm moving back to Strasbourg after two wonderful years in Switzerland, in the canton of St. Gallen. This chapter allowed me to nurture my creativity and refine my technical skills through the complete design and development of websites like this one, while enjoying an inspiring and relaxing environment between mountains and large lakes.",
  "about.personalPresentation_2": "When I'm not coding, I love cooking, drawing, singing, and playing video games with my friends. Naturally curious, I'm driven by the desire to understand how things work and to make them accessible. I enjoy creating simple, useful, and intuitive solutions that make life easier rather than more complicated.",
  "about.personalPresentation_portrait_alt": "Myself in front of the Werdenbergsee and castle, located in Buchs SG, Switzerland",
  "about.backgroundPresentation_portrait_alt": "Myself with my graduation gown and diploma at my graduation ceremony",
  "about.backgroundPresentation_1": "I have always liked figuring things out - whether it was puzzles, math problems, or tricky bugs in my code. That curiosity naturally led me to study software engineering at Telecom Nancy - a french engineering school from the Mines-Telecom institute. It is a generalist program that gave me strong fundamentals in everything from algorithms and system architecture to artificial intelligence and databases, and the flexibility to explore all areas of development and switch from one language to another.",
  "about.backgroundPresentation_2": "I then began my career as a full-stack web engineer at Sopra Steria, within the AI team in Strasbourg, where I worked for three years. I contributed to the development and maintenance of large-scale chatbot solutions, mainly using the MERN stack (MongoDB, Express, React & Node.js).",
  "about.backgroundPresentation_3": "Over the past two years, I've continued to expand my skills through the development of this personal website and a site for a research professor, helping her make her scientific work more accessible and centralize course materials for her students.",
  "about.backgroundPresentation_4": "Today, I'm looking for a web development position in Strasbourg or nearby, or primarily remote. I'd love to join a multidisciplinary team where I can put my skills to use on meaningful, accessible, and purpose-driven projects.",
  "about.resumeIntroduction_1": "If you'd like to know more about my background or specific skills, feel free to take a look at my CV below. And if you have any questions or just want to chat, don't hesitate to ",
  "about.resumeIntroduction_link": "get in touch",
  "about.resumeIntroduction_2": " - I am always happy to connect!",
  "about.openResume": "Open in PDF-viewer",
  "about.downloadResume": "Download",
  "about.resume_alt": "Resume",

  "projects.title": "Discover my work",
  "projects.1.title": "Teacher-researcher website development",
  "projects.1.img_alt": "Teacher-researcher illustration",
  "projects.1.date": "2025 - Currently in designing phase",
  "projects.1.descr": "Design and development of a website for a researcher and lecturer, providing a centralized space to share her research publications and teaching materials with students. This project aims to improve access to educational resources and modernize the presentation of her academic work.",
  "projects.2.title": "Personal portfolio development (aka this website!)",
  "projects.2.img_alt": "Portfolio illustration",
  "projects.2.date": "2025",
  "projects.2.descr": "Design and development of a personal portfolio to strengthen my skills while providing a professional showcase that could be used during my job search. This project also allowed me, for the first time, to take full ownership of a project, from design through development to deployment.",
  "projects.3.title": "Junior Web Engineer at Sopra Steria, Strasbourg, France",
  "projects.3.img_alt": "Chatbot illustration",
  "projects.3.date": "From 2021 to 2024",
  "projects.3.descr": "As a full-stack developer within the Sopra Steria Alive Intelligence team, I contributed to the design, development, and maintenance of a large-scale SaaS chatbot solution. Working daily with Node.js, TypeScript/Javascript, React, IBM Cloud and MongoDB, I was involved in building scalable features across the stack and ensuring the reliability and performance of production systems. I also took part in key optimization efforts to enhance data processing and system stability for major clients.\n\nIn addition to my core development role, I worked on a research and development project aimed at improving chatbot training analytics and optimization. I also contributed to the front-end development of a chatbot Proof of Concept for Airbus, and provided occasional support to the BPM team on front-end projects, fostering collaboration across multiple teams and domains.",
  "projects.gitHubRedirect": "Feel free to visit my ",
  "projects.gitHubRedirect_2": "!",

  "contact.title": "Let's get in touch!",
  "contact.subTitle": "Send me an email!",
  "contact.nameField": "Name",
  "contact.emailField": "Email",
  "contact.subjectField": "Subject",
  "contact.messageField": "Message",
  "contact.sendButton": "Send",
  "contact.alternativeContact_1": "Alternatively, directly send your email at ",
  "contact.alternativeContact_2": " or contact me on ",
  "contact.thankYou": "Thank you for your message!",
  "contact.thankYou_2": "I will get back to you soon.",
  "contact.back": "Back",

  "error.img_alt": "'OOPS' illustration",
  "error.title": "Something went wrong...",
  "error.content_1": "It looks like this page isn’t responding at the moment. This might be due to high traffic or a temporary issue on my end.",
  "error.content_2": "Here are a few things you can try :",
  "error.content_3": "• Refresh the page after a few moments.",
  "error.content_4": "• Check your internet connection.",
  "error.content_5_1": "• If the issue persists, please ",
  "error.content_5_2": "fill an issue",
  "error.content_5_3": " or contact me at ",
  "error.content_6": "I apologize for the inconvenience and appreciate your patience!",

  "legal.title": "Legal Notices",
  "legal.preamble": "This site is a personal and non-professional portfolio.",
  "legal.editor.title": "Site author",
  "legal.editor.content.name": "Name",
  "legal.editor.content.status": "Status: Individual, no commercial activity",
  "legal.host.title": "Hosting details",
  "legal.host.content.intro": "This website is hosted by:",
  "legal.host.content.address_1": "2325 3rd Street, Suite 296",
  "legal.host.content.address_2": "San Francisco, California 94107",
  "legal.property.title": "Intellectual property",
  "legal.property.content": "The content of this site (texts, images, projects) is the property of its author, unless otherwise stated. Reproduction is prohibited without authorisation.",
  "legal.contact.title": "Contact",
  "legal.contact.content_1": "For all enquiries, please use ",
  "legal.contact.content_2": "the contact form",
  "legal.contact.content_3": " or write directly to: ",

  "privacy.title": "Privacy policy",
  "privacy_1_1": "This website includes a contact form that allows visitors to send a message to the site owner.",
  "privacy_1_2": "The following data is collected:",
  "privacy_1_3": "• Name",
  "privacy_1_4": "• Email address",
  "privacy_1_5": "• Subject",
  "privacy_1_6": "• Message",
  "privacy_2": "This data is sent directly via email to the site owner and is not stored on the server or used for any other purpose.",
  "privacy_3_1": "No data is shared with third parties.",
  "privacy_3_2": "This site does not use tracking cookies or analytics tools.",
  "privacy_4": "Purpose of data collection",
  "privacy_4_1": "The collected data is used solely to respond to messages sent via the contact form.",
  "privacy_5": "Data retention",
  "privacy_5_1": "Messages received may be kept in the site owner's email inbox for a maximum period of 1 year.",
  "privacy_5_2": "Messages that are part of an ongoing project or conversation may be retained longer as necessary.",
  "privacy_6": "Your rights",
  "privacy_6_1": "In accordance with the GDPR, you have the right to access, correct, or delete your personal data.",
  "privacy_6_2": "To do so, contact: ",
  "privacy_7": "Data controller",
  "privacy_7_1": "Name"
}
