{
  "layout.responsiveNotSupported": "Désolé, votre appareil ne prend pas en charge toutes les fonctionnalités de ce site Web. Veuillez essayer d'utiliser un autre appareil.",

  "layout.header.logo_alt": "Logo stylisé Malaury Keslick",
  "layout.header.home": "Accueil",
  "layout.header.about": "Présentation",
  "layout.header.projects": "Mes projets",
  "layout.header.contact": "Contact",
  "layout.header.darkMode_alt": "Bascule du mode sombre",

  "layout.footer.madeBy": "Par Malaury Keslick [Maulray]",
  "layout.footer.github_alt": "Logo GitHub",
  "layout.footer.linkedin_alt": "Logo LinkedIn",
  "layout.footer.phone_alt": "Logo téléphone",
  "layout.footer.learnMore": "Vous voulez en savoir plus ?",
  "layout.footer.contact": "Programmons un appel!",

  "homepage.hi": "Hey !",
  "homepage.iAm": "Je suis Malaury Keslick",
  "homepage.jobTitle": "Ingénieure Web et Logiciel spécialisée en Node.js",
  "homepage.learnMore": "Envie d'en savoir plus ?",
  "homepage.contact": "Contactez-moi !",
  "homepage.picture": "Portrait principal",

  "about.title": "Mon parcours et ma vision",
  "about.personalPresentation_1": "Hey ! Moi, c'est Malaury, une ingénieure logiciel de 26 ans. Je reviens m'installer à Strasbourg après deux belles années passées en Suisse, dans le canton de Saint-Gall. Cette parenthèse m'a permis de nourrir ma créativité et de perfectionner mes compétences techniques à travers la conception intégrale de sites web comme celui-ci, tout en profitant d'un cadre inspirant et relaxant entre montagnes et grands lacs.",
  "about.personalPresentation_2": "Quand je ne suis pas en train de coder, j'aime cuisiner, dessiner, chanter et jouer aux jeux vidéos avec mes amis. De nature très curieuse, je suis animée par l'envie de comprendre comment les choses fonctionnent et de les rendre accessibles. J'aime créer des solutions simples, utiles et intuitives, qui facilitent la vie plutôt que de la compliquer.",
  "about.personalPresentation_portrait_alt": "Moi-même devant le lac et le château de Werdenberg, situé à Buchs SG, en Suisse",
  "about.backgroundPresentation_portrait_alt": "Moi-même avec ma robe et mon diplôme lors de la cérémonie de remise des diplômes",
  "about.backgroundPresentation_1": "J’ai toujours aimé résoudre des problèmes, qu’il s’agisse d’énigmes, de questions de logique ou de bugs complexes dans mon code. Cette curiosité m’a tout naturellement menée vers des études en ingénierie logicielle à Telecom Nancy, une école d’ingénieur française rattachée à l’institut Mines-Telecom. J’y ai suivi une formation généraliste exigeante, qui m’a permis d’acquérir de solides bases - de l’algorithmique à l’architecture système, en passant par l'intelligence artificielle et les bases de données - tout en explorant librement les différents aspects du développement et en changeant facilement de langage selon les besoins.",
  "about.backgroundPresentation_2": "J'ai ensuite débuté ma carrière comme ingénieure web full-stack chez Sopra Steria, au sein de l'équipe IA de Strasbourg, dans laquelle je suis restée trois ans. J'y ai participé au développement et au maintient de solutions de chatbots à grande échelle, en utilisant principalement la stack MERN (MongoDB, Express, React & Node.js).",
  "about.backgroundPresentation_3": "Ces deux dernières années, j'ai continué à approfondir mes compétences à travers le développement de ce site personnel et d'un site pour une enseignante-chercheuse, afin de l'aider à rendre ses contenus scientifiques plus accessibles et de centraliser les supports de cours à destination de ses étudiants.",
  "about.backgroundPresentation_4": "Aujourd'hui, je suis à la recherche d'un poste d'ingénieure en développement web à Strasbourg, dans sa périphérie, ou bien majoritairement en télétravail. J'aimerai rejoindre une équipe pluridisciplinaire où je pourrai mettre mes compétences au service de projets utiles, accessibles et porteurs de sens.",
  "about.resumeIntroduction_1": "Si vous souhaitez en savoir plus sur mon parcours ou mes compétences, n’hésitez pas à consulter mon CV ci-dessous. Et si vous avez des questions ou simplement envie d’échanger, n’hésitez pas à ",
  "about.resumeIntroduction_link": "me contacter",
  "about.resumeIntroduction_2": " – je reviendrai vers vous le plus rapidement possible !",
  "about.openResume": "Ouvrir dans un lecteur PDF",
  "about.downloadResume": "Télécharger",
  "about.resume_alt": "CV",

  "projects.title": "Mes projets",
  "projects.1.title": "Développement d'un site pour une enseignante-chercheuse",
  "projects.1.img_alt": "Illustration d'enseignant cherheur",
  "projects.1.date": "2025 - Actuellement en cours de conception",
  "projects.1.descr": "Conception et développement d’un site web pour une enseignante-chercheuse, offrant un espace centralisé pour mettre à disposition ses publications scientifiques et supports de cours pour ses étudiants. Ce projet vise à faciliter l’accès aux ressources pédagogiques et à moderniser la présentation de son travail académique.",
  "projects.2.title": "Développement de mon portfolio : vous y êtes !",
  "projects.2.img_alt": "Illustration de portfolio",
  "projects.2.date": "2025",
  "projects.2.descr": "Conception et développement d’un portfolio personnel afin de consolider mes compétences et de disposer d’une vitrine professionnelle pouvant être utilisée dans le cadre de ma recherche d’emploi. Ce projet m’a également permis, pour la première fois, de prendre entièrement en charge toutes les étapes d’un projet, de la conception au développement, puis au déploiement.",
  "projects.3.title": "Ingénieure Junior Web chez Sopra Steria, Strasbourg, France",
  "projects.3.img_alt": "Illustration de chatbot",
  "projects.3.date": "De 2021 à 2024",
  "projects.3.descr": "J’ai été développeuse full-stack au sein de l’équipe Sopra Steria Alive Intelligence, où j’ai participé à la conception, au développement et à la maintenance d’une solution SaaS de chatbot à grande échelle. Je travaillais quotidiennement avec Node.js, TypeScript/Javascript, React, IBM Cloud et MongoDB, et je créais des fonctionnalités cross-stack tout en veillant à la stabilité et aux performances des systèmes en production. J’ai également contribué à des optimisations importantes pour rendre le traitement des données plus rapide et les systèmes plus fiables pour nos clients.\n\nEn parallèle de mon rôle principal, j’ai travaillé sur un projet de recherche et développement visant à améliorer l’analyse et l’optimisation de l’entraînement des chatbots. J’ai aussi participé au développement front-end d’un Proof of Concept de chatbot pour Airbus, et j’ai apporté un soutien ponctuel à l’équipe BPM sur des projets front-end, ce qui m’a permis de collaborer avec différentes équipes.",
  "projects.gitHubRedirect": "N'hésitez pas à visiter mon ",
  "projects.gitHubRedirect_2": " !",

  "contact.title": "Prenons contact !",
  "contact.subTitle": "Envoyez-moi un email !",
  "contact.nameField": "Nom",
  "contact.nameField.error": "Merci de renseigner votre nom.",
  "contact.emailField": "Email",
  "contact.emailField.error": "Merci de renseigner une adresse email valide.",
  "contact.subjectField": "Sujet",
  "contact.subjectField.error": "Merci de renseigner le sujet de votre message.",
  "contact.messageField": "Message",
  "contact.messageField.error": "Merci de renseigner votre message.",
  "contact.sendButton": "Envoyer",
  "contact.captchaRequired": "Veuillez compléter le captcha avant d'envoyer votre message.",
  "contact.alternativeContact_1": "Sinon, envoyez directement votre email à ",
  "contact.alternativeContact_2": " ou contactez-moi sur ",
  "contact.thankYou": "Merci pour votre message !",
  "contact.thankYou_2": "Je vous recontacte dès que possible.",
  "contact.back": "Retour",
  "contact.error.title": "Oups ! Quelque chose s'est mal passé...",
  "contact.error.descr": "Une erreur est survenue lors de l'envoi de votre message. Je suis désolée pour la gêne occasionnée. Si le problème persiste, veuillez me contacter directement à ",

  "error.img_alt": "Illustration 'OOPS'",
  "error.title": "Quelque chose s'est mal passé...",
  "error.content_1": "Il semble que cette page ne réponde pas pour le moment. Cela peut être dû à un trafic important ou à un problème temporaire de mon côté.",
  "error.content_2": "Voici quelques actions que vous pouvez essayer :",
  "error.content_3": "• Rechargez la page après quelques instants.",
  "error.content_4": "• Vérifiez votre connexion internet.",
  "error.content_5_1": "• Si le problème persiste, vous pouvez ",
  "error.content_5_2": "ouvrir un ticket",
  "error.content_5_3": " ou me contacter à ",
  "error.content_6": "Je m'excuse pour la gêne occasionnée et vous remercie pour votre patience !",

  "legal.title": "Mentions légales",
  "legal.preamble": "Ce site est un portfolio personnel et non professionnel.",
  "legal.editor.title": "Auteur du site",
  "legal.editor.content.name": "Nom ",
  "legal.editor.content.status": "Statut : Particulier, sans activité commerciale",
  "legal.host.title": "Hébergement",
  "legal.host.content.intro": "Ce site est hébergé par :",
  "legal.host.content.address_1": "2325 3rd Street, Suite 296",
  "legal.host.content.address_2": "San Francisco, California 94107",
  "legal.property.title": "Propriété intellectuelle",
  "legal.property.content": "Les contenus présents sur ce site (textes, images, projets) sont la propriété de leur auteur, sauf mention contraire. Toute reproduction est interdite sans autorisation.",
  "legal.contact.title": "Contact",
  "legal.contact.content_1": "Pour toute demande, vous pouvez utiliser ",
  "legal.contact.content_2": "le formulaire de contact",
  "legal.contact.content_3": " ou m'écrire directement à : ",

  "privacy.title": "Politique de confidentialité",
  "privacy_1_1": "Ce site contient un formulaire de contact permettant aux visiteurs d'envoyer un message à l'éditeur du site.",
  "privacy_1_2": "Les données collectées sont :",
  "privacy_1_3": "• Nom",
  "privacy_1_4": "• Adresse email",
  "privacy_1_5": "• Objet du message",
  "privacy_1_6": "• Message",
  "privacy_2": "Ces données sont envoyées directement par email à l’éditeur du site et ne sont pas stockées sur le serveur ni utilisées à d'autres fins.",
  "privacy_3_1": "Aucune donnée n’est transmise à des tiers.",
  "privacy_3_2": "Aucun cookie de suivi ou de mesure d’audience n’est utilisé sur ce site.",
  "privacy_4": "Finalité",
  "privacy_4_1": "Les données collectées sont uniquement utilisées pour répondre aux messages envoyés via le formulaire de contact.",
  "privacy_5": "Durée de conservation",
  "privacy_5_1": "Les messages reçus peuvent être conservés dans la boîte mail de l’éditeur pendant une durée maximale de 1 an.",
  "privacy_5_2": "Les messages faisant partie d’un projet ou d’un échange en cours peuvent être conservés plus longtemps si nécessaire.",
  "privacy_6": "Vos droits",
  "privacy_6_1": "Conformément au RGPD, vous pouvez demander l’accès, la rectification ou la suppression de vos données.",
  "privacy_6_2": "Pour ce faire, écrivez à : ",
  "privacy_7": "Responsable du traitement",
  "privacy_7_1": "Nom "
}
